Repository: jerojasro/django-tutorial-es
Catalog: */overview.po
Languages: es

source: Django at a glance ==================
es: Un vistazo a Django ===================

source: Because Django was developed in a fast-paced newsroom environment, it was designed to make common Web-development tasks fast and easy. Here's an informal overview of how to write a database-driven Web app with Django.
es: Dado que Django se desarrolló en un ambiente editorial con mucho movimiento, fue diseñado para hacer que las tareas comunes del ambiente web fueran rápidas y fáciles. A continuación mostramos un vistazo informal de cómo escribir una aplicación web basada en bases de datos con Django.

source: The goal of this document is to give you enough technical specifics to understand how Django works, but this isn't intended to be a tutorial or reference -- but we've got both! When you're ready to start a project, you can :doc:`start with the tutorial </intro/tutorial01>` or :doc:`dive right into more detailed documentation </topics/index>`.
es: El objetivo de este documento es ofrecerle las especificidades técnicas necesarias para entender cómo funciona Django, no es un tutorial o una referencia -- que de hecho tenemos ambas! Cuando esté listo para iniciar un proyecto puede :doc:`comenzar con el tutorial </intro/tutorial01>` o :doc:`sumergirse en documentación más detallada </topics/index>`.

source: Design your model =================
es: Diseñe su modelo ================

source: Although you can use Django without a database, it comes with an object-relational mapper in which you describe your database layout in Python code.
es: Aunque puede usar Django sin una base de datos, viene con un mapeo objeto-relacional en el cual puede describir la estructura de la base de datos en código Python.

source: The :doc:`data-model syntax </topics/db/models>` offers many rich ways of representing your models -- so far, it's been solving two years' worth of database-schema problems. Here's a quick example, which might be saved in the file ``mysite/news/models.py``::
es: La :doc:`sintaxis del modelo de datos </topics/db/models>` ofrece variadas formas enriquecidas para represenar sus modelos -- hasta ahora ha resuelto dos años de problemas relacionados con esquema de base de datos. A continuación un ejemplo rápido, que puede almacenarse en el fichero ``mysite/news/models.py``::

source: Install it ==========
es: Instálelo =========

source: Next, run the Django command-line utility to create the database tables automatically:
es: A continuación, ejecute la utilidad desde la línea de comandos de Django para crear las tablas en la base de datos de forma automática:

source: The :djadmin:`syncdb` command looks at all your available models and creates tables in your database for whichever tables don't already exist.
es: La orden :djadmin:`syncdb` revisa todos sus modelos disponibles y crea aquellas tablas en su base de datos que todavía no existen.

source: Enjoy the free API ==================
es: Disfrute el API gratuito ========================

source: With that, you've got a free, and rich, :doc:`Python API </topics/db/queries>` to access your data. The API is created on the fly, no code generation necessary::
es: Con esto tiene un :doc:`Python API </topics/db/queries>` rico y de forma gratuita para acceder a su información. El API se crea instantáneamente, no se requiere la generación de código::

source: # No reporters are in the system yet. >>> Reporter.objects.all() []
es: # Todavía no hay reporteros en el sistema. >>> Reporter.objects.all() []

source: # Create a new Reporter. >>> r = Reporter(full_name='John Smith')
es: # Crear un nuevo Reportero. >>> r = Reporter(full_name='John Smith')

source: # Save the object into the database. You have to call save() explicitly. >>> r.save()
es: # Se almacena el objeto en la base de datos. Tiene que invocar save() explícitamente. >>> r.save()

source: # Now it has an ID. >>> r.id 1
es: # Ahora tiene un ID. >>> r.id 1

source: # Now the new reporter is in the database. >>> Reporter.objects.all() [<Reporter: John Smith>]
es: # Ahora el reportero está en la base de datos. >>> Reporter.objects.all() [<Reporter: John Smith>]

source: # Fields are represented as attributes on the Python object. >>> r.full_name 'John Smith'
es: # Los campos se representan como atributos del objeto Python. >>> r.full_name 'John Smith'

source: # Django provides a rich database lookup API. >>> Reporter.objects.get(id=1) <Reporter: John Smith> >>> Reporter.objects.get(full_name__startswith='John') <Reporter: John Smith> >>> Reporter.objects.get(full_name__contains='mith') <Reporter: John Smith> >>> Reporter.objects.get(id=2) Traceback (most recent call last): ... DoesNotExist: Reporter matching query does not exist.
es: # Django ofrece un API de búsqueda rico. >>> Reporter.objects.get(id=1) <Reporter: John Smith> >>> Reporter.objects.get(full_name__startswith='John') <Reporter: John Smith> >>> Reporter.objects.get(full_name__contains='mith') <Reporter: John Smith> >>> Reporter.objects.get(id=2) Traceback (most recent call last): ... DoesNotExist: Reporter matching query does not exist.

source: # Create an article. >>> from datetime import datetime >>> a = Article(pub_date=datetime.now(), headline='Django is cool', ... content='Yeah.', reporter=r) >>> a.save()
es: # Crear un artículo. >>> from datetime import datetime >>> a = Article(pub_date=datetime.now(), headline='Django is cool', ... content='Yeah.', reporter=r) >>> a.save()

source: # Now the article is in the database. >>> Article.objects.all() [<Article: Django is cool>]
es: # Ahora el artículo está en la base de datos. >>> Article.objects.all() [<Article: Django is cool>]

source: # Article objects get API access to related Reporter objects. >>> r = a.reporter >>> r.full_name 'John Smith'
es: # Los objetos Article obtienen una API para acceder a los objetos Reporter relacionados. >>> r = a.reporter >>> r.full_name 'John Smith'

source: # And vice versa: Reporter objects get API access to Article objects. >>> r.article_set.all() [<Article: Django is cool>]
es: # Y vice versa: los objetos Reporter obtienen una API para acceder a los objetos Article. >>> r.article_set.all() [<Article: Django is cool>]

source: # The API follows relationships as far as you need, performing efficient # JOINs for you behind the scenes. # This finds all articles by a reporter whose name starts with "John". >>> Article.objects.filter(reporter__full_name__startswith="John") [<Article: Django is cool>]
es: # La API sigue las relaciones tan profundo como lo requiera, ejecutando # JOINs eficientes tras bambalinas. # A continuación se encuentran todos los artículos de un reportero cuyo nombre comienza con "John". >>> Article.objects.filter(reporter__full_name__startswith="John") [<Article: Django is cool>]

source: # Change an object by altering its attributes and calling save(). >>> r.full_name = 'Billy Goat' >>> r.save()
es: # Se cambia un objeto modificando sus atributos e invocando el método save(). >>> r.full_name = 'Billy Goat' >>> r.save()

source: # Delete an object with delete(). >>> r.delete()
es: # Se elimina un objecto con delete(). >>> r.delete()

source: A dynamic admin interface: it's not just scaffolding -- it's the whole house ============================================================================
es: Una interfaz de administración dinámica: No solamente el andamiaje -- es la casa entera =======================================================================================

source: Once your models are defined, Django can automatically create a professional, production ready :doc:`administrative interface </ref/contrib/admin/index>` -- a Web site that lets authenticated users add, change and delete objects. It's as easy as registering your model in the admin site::
es: Cuando haya definido sus modelos, Django puede crear automáticamente una interfaz administrativa profesional </ref/contrib/admin/index>`, lista para producción : Un sitio web que le permite a usuarios autenticados, añadir, cambiar y eliminar objetos. Basta con registrar su modelo con el sitio administrativo::

source: # In models.py...
es: # En models.py...

source: # In admin.py in the same directory...
es: # En admin.py en el mismo directorio...

source: The philosophy here is that your site is edited by a staff, or a client, or maybe just you -- and you don't want to have to deal with creating backend interfaces just to manage content.
es: Aquí la filosofía es que su sitio lo edita los empleados, un cliente o usted mismo, y no tiene que preocuparse por hacer interfaces de back-end para administrar su contenido.

source: One typical workflow in creating Django apps is to create models and get the admin sites up and running as fast as possible, so your staff (or clients) can start populating data. Then, develop the way data is presented to the public.
es: Un flujo de trabajo típico al crear aplicaciones Django es crear los modelos y echar a andar el sitio administrativo tan rápido como sea posible, de forma que el personal(o los clientes) puedan comenzar a diligenciar datos. Posteriormente desarrollar la forma como los datos serán presentados al público.

source: Design your URLs ================
es: Diseñe sus URLs ===============

source: A clean, elegant URL scheme is an important detail in a high-quality Web application. Django encourages beautiful URL design and doesn't put any cruft in URLs, like ``.php`` or ``.asp``.
es: Un detalle importante en una aplicación web de gran calidad es un esquema de URLs limpio y elegante. Django anima el diseño de URLs hermosas y no añade cosas como ``.php`` o ``.asp``.

source: To design URLs for an app, you create a Python module called a :doc:`URLconf </topics/http/urls>`. A table of contents for your app, it contains a simple mapping between URL patterns and Python callback functions. URLconfs also serve to decouple URLs from Python code.
es: Para diseñar URLs para una aplicación, se crea un módulo de Python llamado :doc:`URLconf </topics/http/urls>`. Es una tabla de contenidos para su aplicación que contiene una relación sencilla entre patrones de URLs y funciones de respuesta en Python. Las URLconfs también sirven para desacoplar las URLs de su código Python.

source: Here's what a URLconf might look like for the ``Reporter``/``Article`` example above::
es: A continuación mostramos cómo podría lucir un URLconf para el ejemplo ``Reportero``/``Artículo`` anterior

source: The code above maps URLs, as simple regular expressions, to the location of Python callback functions ("views"). The regular expressions use parenthesis to "capture" values from the URLs. When a user requests a page, Django runs through each pattern, in order, and stops at the first one that matches the requested URL. (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the regular expressions are compiled at load time.
es: El código anterior relaciona URLs, como expresiones regulares sencillas, al lugar donde se encuentran las funciones Python de respuesta ("views"). Las expresiones regulares usan paréntesis para "capturar" valores de las URLs. Cuando un usuario solicita una página, Django evalúa cada patrón, en orden y se detiene en el primero que concuerda con el URL solicitado. (Si ninguno concuerda, Django invoca una vista especial 404.) Es increíblemente rápido, porque las expresiones regulares se precompilan al momento de carga.

source: Once one of the regexes matches, Django imports and calls the given view, which is a simple Python function. Each view gets passed a request object -- which contains request metadata -- and the values captured in the regex.
es: Una vez que la expresión regular coincide, Django importa y llama la función dada, que es una función sencilla en Python. Cada vista recibe un objeto request (Que contiene los metadatos de la solicitud) y los valores capturados en la expresión regular.

source: For example, if a user requested the URL "/articles/2005/05/39323/", Django would call the function ``news.views.article_detail(request, '2005', '05', '39323')``.
es: Por ejemplo, si un usuario solicitó la URL "/articles/2005/05/39323/", Django invocaría la función ``news.views.article_detail(request, '2005', '05', '39323')``.

source: Write your views ================
es: Escriba sus vistas ==================

source: Each view is responsible for doing one of two things: Returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :class:`~django.http.Http404`. The rest is up to you.
es: Cada vista se encarga de hacer una o dos cosas: Retornar un objeto :class:`~django.http.HttpResponse` que incluye el contenido de la página solicitada, o disparar una excepción tal como :class:`~django.http.Http404`. El resto depende de usted.

source: Generally, a view retrieves data according to the parameters, loads a template and renders the template with the retrieved data. Here's an example view for ``year_archive`` from above::
es: Generalmente, una vista recupera datos a partir de los parámetros, carga una plantilla y la muestra con la información recuperada. A continuación una vista de ejemplo para ``year_archive`` del ejemplo anterior::

source: This example uses Django's :doc:`template system </topics/templates>`, which has several powerful features but strives to stay simple enough for non-programmers to use.
es: Este ejemplo usa el :doc:`sistema de plantillas </topics/templates>`, que cuenta con características poderosas pero se mantiene lo suficientemente sencillo para que los no programadores puedan usarlo.

source: Design your templates =====================
es: Diseñe sus plantillas =====================

source: The code above loads the ``news/year_archive.html`` template.
es: El código anterior carga la plantilla ``news/year_archive.html``.

source: Django has a template search path, which allows you to minimize redundancy among templates. In your Django settings, you specify a list of directories to check for templates. If a template doesn't exist in the first directory, it checks the second, and so on.
es: Django tiene una ruta de búsqueda de plantillas, que le permite minimizar redundancia entre plantillas. En su archivo de configuración de Django se especifica una lista de directorios para buscar plantillas. Si una plantilla no se encuentra en el primero, se busca en el segundo y así sucesivamente.

source: Let's say the ``news/year_archive.html`` template was found. Here's what that might look like:
es: Supongamos que se encontró la plantilla ``news/year_archive.html``. Así es como podría lucir:

source: {% block title %}Articles for {{ year }}{% endblock %}
es: {% block title %}Artículos del {{ year }}{% endblock %}

source: {% block content %} <h1>Articles for {{ year }}</h1>
es: {% block content %} <h1>Artículos del {{ year }}</h1>

source: {% for article in article_list %} <p>{{ article.headline }}</p> <p>By {{ article.reporter.full_name }}</p> <p>Published {{ article.pub_date|date:"F j, Y" }}</p> {% endfor %} {% endblock %}
es: {% for article in article_list %} <p>{{ article.headline }}</p> <p>Por {{ article.reporter.full_name }}</p> <p>Publicado {{ article.pub_date|date:"F j, Y" }}</p> {% endfor %} {% endblock %}

source: Variables are surrounded by double-curly braces. ``{{ article.headline }}`` means "Output the value of the article's headline attribute." But dots aren't used only for attribute lookup: They also can do dictionary-key lookup, index lookup and function calls.
es: Las variables están rodeadas por corchetes dobles. ``{{ article.headline }}`` significa "Muestre el valor del titular del objeto artículo". Pero los puntos no se usan únicamente para atributos: También pueden servir como claves de diccionarios, índices y llamados a funciones.

source: Note ``{{ article.pub_date|date:"F j, Y" }}`` uses a Unix-style "pipe" (the "|" character). This is called a template filter, and it's a way to filter the value of a variable. In this case, the date filter formats a Python datetime object in the given format (as found in PHP's date function; yes, there is one good idea in PHP).
es: Tenga en cuenta que ``{{ article.pub_date|date:"F j, Y" }}`` usa una "interconexión" tipo Unix (el carácter "|"). Es a lo que llamamos un filtro de plantilla, y es una forma para filtrar valores de una variable. En este caso, el filtro fecha da formato a un objeto de dato Python hora fecha en un formato dado(como se especifica en la función fecha de PHP; si, hay una buena idea en PHP).

source: You can chain together as many filters as you'd like. You can write custom filters. You can write custom template tags, which run custom Python code behind the scenes.
es: Puede enlazar tantos filtros como desee. Puede crear sus propios filtros. Puede crear etiquetas de plantilla propias, que ejecutan código Python propio tras bambalinas.

source: Finally, Django uses the concept of "template inheritance": That's what the ``{% extends "base.html" %}`` does. It means "First load the template called 'base', which has defined a bunch of blocks, and fill the blocks with the following blocks." In short, that lets you dramatically cut down on redundancy in templates: each template has to define only what's unique to that template.
es: Finalmente, Django usa el concepto de "herencia de plantillas": Eso es lo que ``{% extends "base.html" %}`` hace. Significa "Primero llame la plantilla llamada 'base', que tiene definidos varios bloques, y llene los bloques con estos bloques." En pocas palabras, le permite eliminar dramáticamente redundancia en plantillas: cada plantilla tiene que definir únicamente lo particular de la plantilla.

source: Here's what the "base.html" template might look like:
es: A continuación un ejemplo de cómo podría lucir la plantilla "base.html":

source: Simplistically, it defines the look-and-feel of the site (with the site's logo), and provides "holes" for child templates to fill. This makes a site redesign as easy as changing a single file -- the base template.
es: Sencillamente define el visual del sitio (con el logotipo del sitio), y provee "huecos" para que las plantillas hijas los llenen. Esto hace que rediseñar un sitio resulte tan sencillo como cambiar un único fichero : la plantilla base.

source: It also lets you create multiple versions of a site, with different base templates, while reusing child templates. Django's creators have used this technique to create strikingly different cell-phone editions of sites -- simply by creating a new base template.
es: También le permite crear múltiples versiones de un sitio, con diferentes plantillas base, reusando las hijas. Los creadores de Django han usado esta técnica para crear versiones para teléfonos celulares impresionantemente distintas, únicamente creando una nueva plantilla base.

source: Note that you don't have to use Django's template system if you prefer another system. While Django's template system is particularly well-integrated with Django's model layer, nothing forces you to use it. For that matter, you don't have to use Django's database API, either. You can use another database abstraction layer, you can read XML files, you can read files off disk, or anything you want. Each piece of Django -- models, views, templates -- is decoupled from the next.
es: Tenga en cuenta que no tiene que usar el sistema de plantillas de Django si prefiere otro sistema. Aunque el sistema de plantillas de Django se encuentra sumamente bien integrado con la capa de modelos de Django, no estamos forzándolo a usarlo. Así mismo, tampoco tiene que emplear el API de bases de datos de Django. Puede usar otra capa de abstracción de bases de datos, puede leer archivos XML, puede leer del disco o de donde desee. Cada pieza de Django : modelos, vistas, plantillas está desacoplada de la siguiente.

source: This is just the surface ========================
es: Esto es sólo el comienzo ========================

source: This has been only a quick overview of Django's functionality. Some more useful features:
es: Este fue solamente un vistazo rápido de las funcionalidades de Django. A continuación otras características útiles:

source: A :doc:`caching framework </topics/cache>` that integrates with memcached or other backends.
es: Un :doc:`framework para hacer caché </topics/cache>` que se integra con memcached y otros backends.

source: A :doc:`syndication framework </ref/contrib/syndication>` that makes creating RSS and Atom feeds as easy as writing a small Python class.
es: Un :doc:`framework de sindicación </ref/contrib/syndication>` que permite crear feeds RSS y Atom con tan solo escribir una clase de Python.

source: More sexy automatically-generated admin features -- this overview barely scratched the surface.
es: Más características sexies generadas automáticamente, este vistazo solamente arañó la superficie.

source: The next obvious steps are for you to `download Django`_, read :doc:`the tutorial </intro/tutorial01>` and join `the community`_. Thanks for your interest!
es: Los siguientes pasos obvios son `descargar Django`_, leer :doc:`el tutorial </intro/tutorial01>` y unirse a `la comunidad`_. Gracias por su interés!

source: .. _download Django: https://www.djangoproject.com/download/ .. _the community: https://www.djangoproject.com/community/
es: .. _descargar Django: https://www.djangoproject.com/download/ .. _la comunidad: https://www.djangoproject.com/community/
